In [4]:
import pandas as pd

In [5]:
schoolfilepath = "schools_complete.csv"
studentfilepath = "students_complete.csv"

In [6]:
schools = pd.read_csv(schoolfilepath, encoding="utf-8")
schools.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [7]:
students = pd.read_csv(studentfilepath, encoding="utf-8")
students.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [8]:
schools.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [9]:
students.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [10]:
unq_schools = schools["school_name"].unique().tolist()
unq_schools

['Huang High School',
 'Figueroa High School',
 'Shelton High School',
 'Hernandez High School',
 'Griffin High School',
 'Wilson High School',
 'Cabrera High School',
 'Bailey High School',
 'Holden High School',
 'Pena High School',
 'Wright High School',
 'Rodriguez High School',
 'Johnson High School',
 'Ford High School',
 'Thomas High School']

In [11]:
tot_schools = len(unq_schools)
tot_schools

15

In [12]:
tot_students = len(students["student_name"])
tot_students

39170

In [13]:
tot_budget = schools["budget"].sum()
tot_budget

24649428

In [14]:
avg_math_score = round(students["math_score"].mean(),2)
avg_math_score

78.99

In [15]:
avg_read_score = round(students["reading_score"].mean(),2)
avg_read_score

81.88

In [16]:
passing_math = (len(students[students["math_score"] > 65]))
passing_math

32555

In [17]:
passing_reading = (len(students[students["reading_score"] > 65]))
passing_reading

36923

In [18]:
pct_passing_math = round((passing_math/tot_students)*100,2)
pct_passing_math

83.11

In [19]:
pct_passing_reading = round((passing_reading/tot_students)*100,2)
pct_passing_reading

94.26

In [20]:
pass_rate = round((pct_passing_math + pct_passing_reading)/2,2)
pass_rate

88.69

In [21]:
district_summary = pd.DataFrame({"Total Schools":[tot_schools],
                                 "Total Students":[tot_students],
                                 "Total Budget":[tot_budget],
                                 "Average Math Score":[avg_math_score],
                                 "Average Reading Score":[avg_read_score],
                                 "% Passing Math":[pct_passing_math],
                                 "% Passing Reading":[pct_passing_reading],
                                 "Overall Passing Rate":[pass_rate]})

district_summary["Total Students"]=district_summary["Total Students"].map("{:,}".format)
district_summary["Total Budget"]=district_summary["Total Budget"].map("${:,}".format)
district_summary["Average Math Score"]=district_summary["Average Math Score"].map("{:}%".format)
district_summary["Average Reading Score"]=district_summary["Average Reading Score"].map("{:}%".format)
district_summary["% Passing Math"]=district_summary["% Passing Math"].map("{:}%".format)
district_summary["% Passing Reading"]=district_summary["% Passing Reading"].map("{:}%".format)
district_summary["Overall Passing Rate"]=district_summary["Overall Passing Rate"].map("{:}%".format)
district_summary

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,Overall Passing Rate
0,15,"39,170","$24,649,428",78.99%,81.88%,83.11%,94.26%,88.69%

In [23]:
all_school_data = pd.merge(students,schools,on="school_name")
all_school_data.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [28]:
total_students_per_school = all_school_data[["school_name","student_name"]]
total_students_per_school = total_students_per_school.groupby(["school_name"])
total_students_per_school = total_students_per_school.count()
total_students_per_school = total_students_per_school.rename(columns={"student_name":"student_count"})
total_students_per_school

                       student_count
school_name
Bailey High School              4976
Cabrera High School             1858
Figueroa High School            2949
Ford High School                2739
Griffin High School             1468
Hernandez High School           4635
Holden High School               427
Huang High School               2917
Johnson High School             4761
Pena High School                 962
Rodriguez High School           3999
Shelton High School             1761
Thomas High School              1635
Wilson High School              2283
Wright High School              1800

In [30]:
school_budgt = schools[["school_name","budget"]]
school_budgt

              school_name   budget
0       Huang High School  1910635
1    Figueroa High School  1884411
2     Shelton High School  1056600
3   Hernandez High School  3022020
4     Griffin High School   917500
5      Wilson High School  1319574
6     Cabrera High School  1081356
7      Bailey High School  3124928
8      Holden High School   248087
9        Pena High School   585858
10     Wright High School  1049400
11  Rodriguez High School  2547363
12    Johnson High School  3094650
13       Ford High School  1763916
14     Thomas High School  1043130

In [31]:
school_budgt = pd.merge(total_students_per_school,school_budgt,on="school_name")
school_budgt["budgt_per_student"] = school_budgt["budget"]/school_budgt["student_count"]
school_budgt

              school_name  student_count   budget  budgt_per_student
0      Bailey High School           4976  3124928              628.0
1     Cabrera High School           1858  1081356              582.0
2    Figueroa High School           2949  1884411              639.0
3        Ford High School           2739  1763916              644.0
4     Griffin High School           1468   917500              625.0
5   Hernandez High School           4635  3022020              652.0
6      Holden High School            427   248087              581.0
7       Huang High School           2917  1910635              655.0
8     Johnson High School           4761  3094650              650.0
9        Pena High School            962   585858              609.0
10  Rodriguez High School           3999  2547363              637.0
11    Shelton High School           1761  1056600              600.0
12     Thomas High School           1635  1043130              638.0
13     Wilson High School           2283  1319574              578.0
14     Wright High School           1800  1049400              583.0

In [26]:
school_math_avg = all_school_data[["school_name","type","math_score"]]
school_math_avg = school_math_avg.groupby(["school_name"])
school_math_avg = school_math_avg.mean()
school_math_avg = school_math_avg.rename(columns={"math_score":"math_avg"})
school_math_avg

                        math_avg
school_name
Bailey High School     77.048432
Cabrera High School    83.061895
Figueroa High School   76.711767
Ford High School       77.102592
Griffin High School    83.351499
Hernandez High School  77.289752
Holden High School     83.803279
Huang High School      76.629414
Johnson High School    77.072464
Pena High School       83.839917
Rodriguez High School  76.842711
Shelton High School    83.359455
Thomas High School     83.418349
Wilson High School     83.274201
Wright High School     83.682222

In [32]:
school_reading_avg = all_school_data[["school_name","reading_score"]]
school_reading_avg = school_reading_avg.groupby(["school_name"])
school_reading_avg = school_reading_avg.mean()
school_reading_avg = school_reading_avg.rename(columns={"reading_score":"reading_avg"})
school_reading_avg

                       reading_avg
school_name
Bailey High School       81.033963
Cabrera High School      83.975780
Figueroa High School     81.158020
Ford High School         80.746258
Griffin High School      83.816757
Hernandez High School    80.934412
Holden High School       83.814988
Huang High School        81.182722
Johnson High School      80.966394
Pena High School         84.044699
Rodriguez High School    80.744686
Shelton High School      83.725724
Thomas High School       83.848930
Wilson High School       83.989488
Wright High School       83.955000